In [16]:
import pandas as pd

In [17]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [18]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [19]:
df.loc[0] = ["Allen", 22, 175]

In [20]:
df

    Name  Age  Height
0  Allen   22     175

## Do something
- subtitle1
- subtitle2

In [21]:
df.loc[1] = ["Tde", 25, 180]
df

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [22]:
df["Weight"] = [75, 80]
df

    Name  Age  Height  Weight
0  Allen   22     175      75
1    Tde   25     180      80

In [23]:
df["Weight"] = 85
df

    Name  Age  Height  Weight
0  Allen   22     175      85
1    Tde   25     180      85

In [24]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [25]:
df

    Name  Age  Height  Weight
0  Allen   22     175      85
1    Tde   25     180      85

In [28]:
df = df.drop("Weight", axis=1)
df

KeyError: "['Weight'] not found in axis"

In [29]:
df

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [30]:
df.drop(1)

    Name  Age  Height
0  Allen   22     175

In [31]:
df

    Name  Age  Height
0  Allen   22     175
1    Tde   25     180

In [32]:
df["Height"]

0    175
1    180
Name: Height, dtype: int64

In [33]:
df["Height"][0]

np.int64(175)

In [34]:
df["Height"][0] = 178
df

/tmp/ipykernel_6322/1696690987.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Height"][0] = 178

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180

In [35]:
columns = ["Name", "Age", "Height"]
data = [
    ["Judy", 28, 60],
    ["Trump", 30, 77],
]

new_df = pd.DataFrame(
    data=data,
    columns=columns,
)

new_df

    Name  Age  Height
0   Judy   28      60
1  Trump   30      77

In [36]:
pd.concat(
    [df, new_df],
)

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180
0   Judy   28      60
1  Trump   30      77

In [37]:
df_concat = pd.concat(
    [df, new_df],
)

df_concat

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180
0   Judy   28      60
1  Trump   30      77

In [39]:
df_concat.reset_index(drop=True)

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180
2   Judy   28      60
3  Trump   30      77

In [40]:
df_concat = df_concat.reset_index(drop=True)

df_concat

    Name  Age  Height
0  Allen   22     178
1    Tde   25     180
2   Judy   28      60
3  Trump   30      77